spec/fixtures/payment_response.json

{"id":"PAY-001","intent":"sale","state":"approved","cart":"ABC00000000000001","payer":{"payment_method":"paypal","status":"VERIFIED","payer_info":{"email":"spree@example.com","first_name":"Spree","last_name":"Example","payer_id":"PAYER00000001","shipping_address":{"recipient_name":"Spree Example","line1":"Av. de la Pelouse, 87648672 Mayet","city":"Paris","state":"Alsace","postal_code":"75002","country_code":"FR"},"country_code":"FR"}},"transactions":[{"amount":{"total":"35.99","currency":"USD","details":{"subtotal":"19.99","tax":"1.00","shipping":"15.00"}},"payee":{"email":"admin@example.com"},"description":"This is the sale description","item_list":{"items":[{"name":"Ruby on Rails Jr. Spaghetti","sku":"ROR-00013","price":"19.99","currency":"USD","quantity":1}],"shipping_address":{"recipient_name":"Spree Example","line1":"Av. de la Pelouse, 87648672 Mayet","city":"Paris","state":"Alsace","postal_code":"75002","country_code":"FR"}},"related_resources":[{"sale":{"id":"ABC00000000000001","state":"completed","amount":{"total":"23.99","currency":"USD","details":{"subtotal":"17.99","tax":"1.00","shipping":"5.00"}},"payment_mode":"INSTANT_TRANSFER","protection_eligibility":"ELIGIBLE","protection_eligibility_type":"ITEM_NOT_RECEIVED_ELIGIBLE,UNAUTHORIZED_PAYMENT_ELIGIBLE","transaction_fee":{"value":"1.24","currency":"USD"},"parent_payment":"PAY-001","create_time":"2017-03-09T20:11:51Z","update_time":"2017-03-09T20:11:51Z","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/sale/ABC00000000000001","rel":"self","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/sale/ABC00000000000001/refund","rel":"refund","method":"POST"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-001","rel":"parent_payment","method":"GET"}]}}]}],"redirect_urls":{"return_url":"example.com/?paymentId=PAY-5AU66415CX677254SLDAEMLQ","cancel_url":"example.com"},"create_time":"2017-03-08T17:58:05Z","update_time":"2017-03-08T17:58:46Z","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-001","rel":"self","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-001/execute","rel":"execute","method":"POST"},{"href":"https://www.sandbox.paypal.com/cgi-bin/webscr?cmd=_express-checkout&token=EC-00000000000000001","rel":"approval_url","method":"REDIRECT"}]}
